app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 12]]
---
<h1>Все коментарии</h1>
<% @post.comments.each do |comment| %>