app/controllers/posts_controller.rb

  def create
    #{render plain: params[:post].inspect}

    @post = Post.new(post_params)
    if(@post.save)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "1eqw"], ["body", "21eqweq"], ["created_at", "2022-01-16 15:10:08.584386"], ["updated_at", "2022-01-16 15:10:08.584386"]]

  def update
    @post= Post.find(params[:id])

    if(@post.update(post_params))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "1eqwcsafcsa"], ["updated_at", "2022-01-16 15:10:15.083987"], ["id", 9]]